{"data":{"site":{"siteMetadata":{"title":"Sin Ideas","author":"Eduardo Reveles"}},"markdownRemark":{"id":"51b244c7-447a-5a8d-8495-bb54d01389e0","excerpt":"No soy un usuario muy asiduo de Linux, pero de vez en cuando me gusta cambiar de SO y ver que puedo aprender. Tengo tiempo leyendo…","html":"<p>No soy un usuario muy asiduo de Linux, pero de vez en cuando me gusta cambiar de SO y ver que puedo aprender. Tengo tiempo leyendo <a href=\"http://www.kriptopolis.org/\" target=\"_blank\" rel=\"noopener\">Kriptópolis</a>, y de vez en cuando hablan sobre <a href=\"http://archlinux.org/\" target=\"_blank\" rel=\"noopener\">Arch-Linux</a>. Me había llamado la atención desde una de las primeras veces que lei sobre esta distro, pero no lo había instalado más que nada por pereza. Pero el otro día al leer la decisión de <a href=\"http://www.divergencia.es/blog/2007/09/19/arch-linux\" target=\"_blank\" rel=\"noopener\">alguien más</a> de usar Arch a causa de lo que leía en Kriptópolis, y en vista de que no tenía nada que hacer, me decidí a instalarlo. Llevo poco tiempo usándolo, pero la verdad me encanta. La mayor parte de la configuración se hace en ficheros de texto, lo cual hace bastante fácil el cambiar cosas.. agregar un _daemon_ no cuesta nada mas que instalarlo y agregar su nombre a una línea de un fichero. Del manejador de paquetes, pacman, ni que decir. Los paquetes que no estén ahí, puedes encontrarlos en el <a href=\"http://aur.archlinux.org/\" target=\"_blank\" rel=\"noopener\">AUR</a> (Arch-Linux User-community Repository) e instalarlos igual de <a href=\"http://www.archlinux.com.ar/wiki/index.php/Instalando_desde_AUR\" target=\"_blank\" rel=\"noopener\">fácil</a>. En fin, no mucho que decir, simplemente una maravilla.. yo estaba contento con Debian, pero no conocía Arch xD</p>","frontmatter":{"title":"Mi experiencia con Arch-Linux","date":"September 28, 2007"}}},"pageContext":{"slug":"mi-experiencia-con-arch-linux","previous":{"fields":{"slug":"denny-crane-rlz"},"frontmatter":{"title":"Denny Crane Rlz"}},"next":{"fields":{"slug":"detectar-bloqmayus-con-javascript"},"frontmatter":{"title":"Detectar BloqMayus con Javascript"}}}}