{"data":{"site":{"siteMetadata":{"title":"Sin Ideas","author":"Eduardo Reveles"}},"markdownRemark":{"id":"2a5b45ce-f268-5e40-a6f5-0ac6755ee164","excerpt":"Rodo  me mando un correo, que era más cadena, pero que me gustó =P Se cuenta que en una ciudad del interior, un grupo de personas se…","html":"<p><a href=\"http://rodo.otaku-anime.com/\" target=\"_blank\" rel=\"noopener\">Rodo</a> me mando un correo, que era más cadena, pero que me gustó =P</p>\n<blockquote>\n<p>Se cuenta que en una ciudad del interior, un grupo de personas se divertían con el pendejo del pueblo, un pobre infeliz, de poca inteligencia, que vivía haciendo pequeños mandados y limosnas. Diariamente algunos hombres llamaban al pendejo al bar donde se reunían y le ofrecían escoger entre dos monedas: una de tamaño grande de 400 reales y otra de menor tamaño, pero de 2000 reales. Él siempre cogía la más grande y menos valiosa, lo que era motivo de risas para todos. Un día, alguien que observaba al grupo divertirse con el inocente hombre, le llamó aparte y le preguntó si todavía no había percibido que la moneda de mayor tamaño valía menos y este le respondió: Lo sé, no soy tan pendejo Ella vale cinco veces menos, pero el día que escoja la otra, el jueguito acaba y no voy a ganar más mi moneda.</p>\n</blockquote>\n<p>Esta historia podría concluir aquí, como un simple chiste, pero se pueden sacar varias conclusiones:</p>\n<ul>\n<li>La primera: Quien parece pendejo, no siempre lo es.</li>\n<li>La segunda: ¿Cuáles eran los verdaderos pendejo de la historia?</li>\n<li>La tercera: Una ambición desmedida puede acabar cortando tu fuente de ingresos.</li>\n</ul>\n<p>Pero la conclusión más interesante es: Podemos estar bien, aun cuando los otros no tengan una buena opinión sobre nosotros mismos. Por lo tanto, lo que importa no es lo que piensan de nosotros, sino lo que uno piensa de sí mismo.</p>\n<blockquote>\n<p>“El verdadero hombre inteligente es el que aparenta ser pendejo delante de un pendejo que aparenta ser inteligente”</p>\n</blockquote>","frontmatter":{"title":"¿Pendejo?","date":"April 09, 2006"}}},"pageContext":{"slug":"pendejo","previous":{"fields":{"slug":"simplificar-codigo"},"frontmatter":{"title":"Simplificar código"}},"next":{"fields":{"slug":"theres-other-ways-to-fill-your-head"},"frontmatter":{"title":"There's other ways to fill your head"}}}}