{"data":{"site":{"siteMetadata":{"title":"Sin Ideas","author":"Eduardo Reveles"}},"markdownRemark":{"id":"defb0650-dffd-52de-988a-ebe90b55bc08","excerpt":"Un hombre se fue a cortar el cabello y la barba. Como suele suceder, él y el barbero se pusieron a conversar sobre diversos asuntos hasta…","html":"<blockquote>\n<p>Un hombre se fue a cortar el cabello y la barba. Como suele suceder, él y el barbero se pusieron a conversar sobre diversos asuntos hasta que – comentando una noticia del diario sobre niños abandonados – el barbero afirmó:\n– Como usted podrá ver, esta tragedia demuestra que Dios no existe.\n– ¿Cómo?\n– ¿Es que no lee los diarios? Hay tanta gente sufriendo, criaturas abandonadas, crímenes de toda clase. Si Dios existiera, no habría sufrimiento.\nEl cliente se quedó pensando, pero el corte estaba casi finalizado y decidió no prolongar la conversación. Volvieron a discutir sobre temas más amenos y una vez terminado el servicio, el cliente pagó y salió.\nEntretanto, la primera cosa que vio al salir fue un mendigo, con barba de muchos días y largos cabellos desgreñados. Inmediatamente regresó a la barbería y dijo a quien lo había atendido:\n– ¿Sabe una cosa? Los barberos no existen.\n– ¡Cómo que no existen! Yo estoy aquí, y soy barbero.\n– ¡No existen!- insistió el hombre. – Porque si existieran, no habría personas con una barba tan grande y un cabello tan desgreñado como el que acabo de ver en la esquina.\n– Puedo asegurarle que los barberos existen. Lo que sucede es que ese hombre nunca vino hasta aquí.\n– ¡Exactamente! Entonces, para responder a su pregunta, Dios también existe. Lo que sucede es que las personas no van hacia Él. Si lo buscaran, serían más solidarios, y no habría tanta miseria en el mundo.</p>\n</blockquote>\n<p>Visto en <a href=\"http://www.warriorofthelight.com/espa/edi50_viajando.shtml\" target=\"_blank\" rel=\"noopener\">Warrior of the Light</a></p>","frontmatter":{"title":"Dudando de la existencia de Dios","date":"January 01, 2006"}}},"pageContext":{"slug":"dudando-de-la-existencia-de-dios","previous":{"fields":{"slug":"la-vida-es-un-instante"},"frontmatter":{"title":"La vida es un instante"}},"next":{"fields":{"slug":"homero-simpson-y-yo"},"frontmatter":{"title":"Homero Simpson y yo"}}}}