{"data":{"site":{"siteMetadata":{"title":"Sin Ideas","author":"Eduardo Reveles"}},"markdownRemark":{"id":"a381d70e-5774-5f48-bffb-dc9033d01070","excerpt":"Un sultán decidió hacer un viaje en barco con algunos de sus mejores cortesanos. Se embarcaron en el puerto de Dubai y zarparon en dirección…","html":"<blockquote>\n<p>Un sultán decidió hacer un viaje en barco con algunos de sus mejores cortesanos. Se embarcaron en el puerto de Dubai y zarparon en dirección al mar abierto.</p>\n<p>Entretanto, en cuanto el navío se alejó de tierra, uno de los súbditos – que jamás había visto el mar, y había pasado la mayor parte de su vida en las montañas – comenzó a tener un ataque de pánico: sentado en la bodega de la nave lloraba, gritaba y se negaba a comer o a dormir. Todos procuraban calmarlo, diciendole que el viaje no era tan peligroso, pero aunque las palabras llegasen a sus oídos no llegaban a su corazón. El sultán no sabía qué hacer, y el hermoso viaje por aguas tranquilas y cielo azul se transformó en un tormento para los pasajeros y la tripulación.</p>\n<p>Pasaron dos días sin que nadie pudiese dormir con los gritos del hombre. El sultán ya estaba a punto de mandar volver al puerto cuando uno de sus ministros, conocido por su sabiduría, se le aproximó:</p>\n<p>– Si Su Alteza me da permiso, yo conseguiré calmarlo.</p>\n<p>Sin dudar un instante, el sultán le respondió que no solo se permitía, sino que sería recompensado si consiguiera solucionar el problema.</p>\n<p>El sabio entonces pidió que tirasen al hombre al mar. En el momento, contentos de que esa pesadilla fuera a terminar, un grupo de tripulantes agarró al hombre que se debatía en la bodega y lo tiraron al agua.</p>\n<p>El cortesano comenzó a debatirse, se hundió, tragó agua salada, volvió a la superficie, gritó más fuerte aún, se volvió a hundir y de nuevo consiguió reflotar. En ese momento, el ministro pidió que lo alzasen nuevamente hasta la cubierta del barco.</p>\n<p>A partir de aquel episodio, nadie volvió a escuchar jamás cualquier queja del hombre, que pasó el resto del viaje en silencio, llegando incluso a comentar con uno de los pasajeros que nunca había visto nada tan bello como el cielo y el mar unidos en el horizonte. El viaje – que antes era un tormento para todos los que se encontraban en el barco – se transformó en una experiencia de armonía y tranquilidad.</p>\n<p>Poco antes de regresar al puerto, el Sultán fue a buscar al ministro:</p>\n<p>-¿Cómo podías adivinar que arrojando a aquel pobre hombre al mar se calmaría?</p>\n<p>– Por causa de mi matrimonio – respondió el ministro. Yo vivía aterrorizado con la idea de perder a mi mujer, y mis celos eran tan grandes que no paraba de llorar y gritar como este hombre. Un día ella no aguantó más y me abandonó, y yo pude sentir lo terrible que sería la vida sin ella. Solo regresó después de que le prometí que jamás volvería a atormentarla con mis miedos.</p>\n<p>De la misma manera, este hombre jamás había probado el agua salada y jamás se había dado cuenta de la agonía de un hombre a punto de ahogarse. Después que conoció eso, entendió perfectamente lo maravilloso que es sentir las tablas del barco bajo sus pies.</p>\n<p>Sabia actitud – comentó el sultán\n– Está escrito en un libro sagrado de los cristianos, la Biblia: “todo aquello que yo más temía, terminó sucediendo”. Ciertas personas solo consiguen valorar lo que tienen cuando experimentan la sensación de su pérdida.</p>\n</blockquote>\n<p>Visto en <a href=\"http://www.warriorofthelight.com/espa/edi29_desc.shtml\" target=\"_blank\" rel=\"noopener\">Warrior of the Light</a></p>","frontmatter":{"title":"Descubriendo el verdadero miedo","date":"November 27, 2005"}}},"pageContext":{"slug":"descubriendo-el-verdadero-miedo","previous":null,"next":{"fields":{"slug":"la-vida-es-un-instante"},"frontmatter":{"title":"La vida es un instante"}}}}