{"data":{"site":{"siteMetadata":{"title":"Sin Ideas","author":"Eduardo Reveles"}},"markdownRemark":{"id":"1a3cef25-546f-5c77-a6ee-146ad9615283","excerpt":"It was a car accident. Nothing particularly remarkable, but fatal nonetheless. You left behind a wife and two children. It was a painless…","html":"<blockquote>\n<p>It was a car accident. Nothing particularly remarkable, but fatal nonetheless. You left behind a wife and two children. It was a painless death. The EMTs tried their best to save you, but to no avail. Your body was so utterly shattered you were better off, trust me.</p>\n<p>And that’s when you met me.</p>\n<p>“What… what happened?” You asked. “Where am I?”</p>\n<p>“You died,” I said, matter-of-factly. No point mincing words.</p>\n<p>“There was a… a truck and it was skidding…”</p>\n<p>“Yup.” I said</p>\n<p>“I… I died?”</p>\n<p>“Yup. But don’t feel bad about it. Everyone dies.” I said.</p>\n<p>You looked around. There was nothingness. Just you and me. “What is this place?” You asked. “Is this the afterlife?”</p>\n<p>“More or less,” I said.</p>\n<p>“Are you God?” You asked.</p>\n<p>“Yup.” I replied. “I’m God.”</p>\n<p>“My kids… my wife,” you said.</p>\n<p>“What about them?”</p>\n<p>“Will they be alright?”</p>\n<p>“That what I like to see,” I said. “You just died and your main concern is for your family. That’s good stuff right there.”</p>\n<p>You looked at me with fascination. To you, I didn’t look like God. I just looked like some man. Some vague authority figure. More of a grammar school teacher than the almighty.</p>\n<p>“Don’t worry,” I said. “They’ll be fine. Your kids will remember you as perfect in every way. They didn’t have time to grow contempt for you. Your wife will cry on the outside, but will be secretly relieved. To be fair, your marriage was falling apart. If it’s any consolation, she’ll feel very guilty for feeling relieved.”</p>\n<p>“Oh,” you said. “So what happens now? Do I go to heaven or hell or something?”</p>\n<p>“Neither,” I said. “You’ll be reincarnated.”</p>\n<p>“Ah,” you said. “So the Hindus were right.”</p>\n<p>“All the religions are right in their own way,” I said. “Walk with me.”</p>\n<p>You followed along as we strolled in the void. “Where are we going?” “Nowhere in particular,” I said. “It’s just nice to walk while we talk.”</p>\n<p>“So what’s the point, then?” You asked. “When I get reborn, I’ll just be a blank slate, right? A baby. So all my experiences and everything I did in this life won’t matter.”</p>\n<p>“Not so!” I said. “You have within you all the knowledge and experiences of all your past lives. You just don’t remember them right now.”</p>\n<p>I stopped walking and took you by the shoulders. “Your soul is more magnificent, beautiful, and gigantic than you can possibly imagine. A human mind can only contain a tiny fraction of what you are. It’s like sticking your finger in a glass of water to see if it’s hot or cold. You put a tiny part or yourself into the vessel, and when you bring it back out, you’ve gained all the experiences it had.”</p>\n<p>“You’ve been a human for the last 34 years, so you haven’t stretched out yet and felt the rest of your immense consciousness. If we hung out here for longer, you’d start remembering everything. But there’s no point doing that between each life.”</p>\n<p>“How many times have I been reincarnated, then?”</p>\n<p>“Oh, lots. Lots and lots. And into lots of different lives.” I said. “This time around you’ll be a Chinese peasant girl in 540 A.D.”</p>\n<p>“Wait, what?” You stammered. “You’re sending me back in time?”</p>\n<p>“Well, I guess technically. Time, as you know it, only exists in your universe. Things are different where I come from.”</p>\n<p>“Where do you come from?” You pondered.</p>\n<p>“Oh sure!” I explained. “I come from somewhere. Somewhere else. And there are others like me. I know you’ll want to know what it’s like there but you honestly won’t understand.”</p>\n<p>“Oh.” you said, a little let down. “But wait. If I get reincarnated to other places in time, could I have interacted with myself at some point?”</p>\n<p>“Sure. Happens all the time. And with both lives only aware of their own timespan you don’t even know it’s happening.”</p>\n<p>“So what’s the point of it all?”</p>\n<p>“Seriously?” I asked. “Seriously? Your asking me for the meaning of life? Isn’t that a little stereotypical?”</p>\n<p>“Well it’s a reasonable question,” you persisted.</p>\n<p>I looked in your eye. “The meaning of life, the reason I made this whole universe, is for you to mature.”</p>\n<p>“You mean mankind? You want us to mature?”</p>\n<p>“No. just you. I made this whole universe for you. With each new life you grow and mature, and become a larger and greater intellect.”</p>\n<p>“Just me? What about everyone else?”</p>\n<p>“There is no one else,” I said. “In this universe, there’s just you, and me.”</p>\n<p>You stared blankly at me. “But all the people on earth…”</p>\n<p>“All you. Different incarnations of you.”</p>\n<p>“Wait. I’m everyone!?”</p>\n<p>“Now you’re getting it.” I said, with a congratulatory slap on the back.</p>\n<p>“I’m every human who ever lived?”</p>\n<p>“Or who will ever live, yes.”</p>\n<p>“I’m Abraham Lincoln?”</p>\n<p>“And you’re John Wilkes Booth, too.” I added.</p>\n<p>“I’m Hitler?” you said, appalled.</p>\n<p>“And you’re the millions he killed.”</p>\n<p>“I’m Jesus?”</p>\n<p>“And you’re everyone who followed him.”</p>\n<p>You fell silent.</p>\n<p>“Every time you victimized someone,” I said, “You were victimizing yourself. Every act of kindness you’ve done, you’ve done to yourself. Every happy and sad moment ever experienced by any human was, or will be, experienced by you.”</p>\n<p>“Why?” You asked me. “Why do all this?”</p>\n<p>“Because someday, you will become like me. Because that’s what you are. You’re one of my kind. You’re my child.”</p>\n<p>“Whoa.” you said, incredulous. “You mean I’m a god?”</p>\n<p>“No. Not yet. You’re a fetus. You’re still growing. Once you’ve lived every human life throughout all time, you will have grown enough to be born.”</p>\n<p>“So the whole universe,” you said. “It’s just…”</p>\n<p>“An egg of sorts.” I answered. “Now it’s time for you to move on to your next life.”</p>\n<p>And with that, I sent you on your way.</p>\n</blockquote>\n<p><a href=\"http://creepypasta.wikia.com/wiki/An_Egg\" target=\"_blank\" rel=\"noopener\">http://creepypasta.wikia.com/wiki/An_Egg</a></p>","frontmatter":{"title":"An Egg","date":"November 24, 2015"}}},"pageContext":{"slug":"an-egg","previous":{"fields":{"slug":"breaking-bad-fan-video-walt-jesse"},"frontmatter":{"title":"Breaking Bad Fan video:  Walt & Jesse"}},"next":null}}