{"data":{"site":{"siteMetadata":{"title":"Sin Ideas","author":"Eduardo Reveles"}},"markdownRemark":{"id":"f579fbad-1e67-50e8-9cdb-32871e5045aa","excerpt":"Estoy aburrido y me topé con un  post  de  @juliettemaxwell  sobre cómo fue que empezó a programar. Me gustó la idea, así que va mi historia…","html":"<p>Estoy aburrido y me topé con un <a href=\"http://littlej.in/2015/06/mycodingstory-womenintech/\" target=\"_blank\" rel=\"noopener\">post</a> de <a href=\"https://twitter.com/juliettemaxwell\" target=\"_blank\" rel=\"noopener\">@juliettemaxwell</a> sobre cómo fue que empezó a programar. Me gustó la idea, así que va mi historia.</p>\n<p>Recuerdo vagamente que cuando tenía alrededor de 10 años mi mamá nos mandó a uno de mis hermanos y a mi a un curso de MS-DOS. Creo que en aquel entonces se usaba Windows 3.1 y nos enseñaron comandos básicos como copiar archivos, moverlos, las unidades (C:, D:, etc), editar archivos y todo con disquetes de 5 1/4 y 3 1/2 :D</p>\n<p>Poco tiempo después fuimos a otro “curso” donde se supone veíamos mas usos de la PC (aun con mucho MS-DOS), pero lo que hacíamos era llegar y poner los disquetes que todos teníamos con juegos. <a href=\"http://en.wikipedia.org/wiki/Prince_of_Persia_(1989_video_game)\" target=\"_blank\" rel=\"noopener\">Principe de Persia</a> era el favorito de todos.</p>\n<p>Un par de años después tomamos otro curso que duró dos años donde nos enseñaron desde armar y desarmar computadoras, las piezas que la componen, la instalación de windows y office (?) y otras cosas mas. Pero sobre todo fue el primer acercamiento de verdad a la programación, ya que los últimos módulos fue hacer programas sencillos en BASIC y Pascal. Creo recordar que se me daba bien eso y me gustaba mucho.</p>\n<p>Casi al mismo tiempo tuvimos la primer PC en casa y gracias a un trabajo de la escuela que usé como excusa, internet (había que investigar, ¿no?).  A pesar de todo, en ese entonces no sabía que quería hacer cuando creciera (xD). Cuando empezó en verdad todo fue el día que encontré en un puesto de revistas un especial de <a href=\"http://en.wikipedia.org/wiki/Neon_Genesis_Evangelion\" target=\"_blank\" rel=\"noopener\">Evangelion</a>, y me gustó tanto que dije “ok, quiero hacer un sitio de esto”.</p>\n<p>Empecé buscando como hacer un sitio, y al poco tiempo tenía la primera versión de mi sitio de Evangelion hecha con FrontPage. Eran dos iframes, uno el menú y el otro el contenido (copiado letra por letra de la revista). Luego quise hacer algo mas grande, no solo enfocado a Evangelion, y empecé a aprender un poco de PHP. Tomaba algunas cosas de <a href=\"http://www.php-hispano.net/\" target=\"_blank\" rel=\"noopener\">PHP-Hispano</a> y las modificaba hasta que hacían lo que quería. Cuando tenía que hacer un cambio pequeño me daba pereza abrir FrontPage (o Dreamweaver), así que empecé a hacer los cambios con el bloc de notas (y poco tiempo después con <a href=\"https://notepad-plus-plus.org/\" target=\"_blank\" rel=\"noopener\">Notepad++</a>, y esto ayudaba a que me aprendía mas cosas.</p>\n<p>El <a href=\"https://web.archive.org/web/20030602171421/http://otakuanime.vivelared.com/main.php\" target=\"_blank\" rel=\"noopener\">sitio</a> fue creciendo un poco y puse un foro usando <a href=\"https://www.phpbb.com/\" target=\"_blank\" rel=\"noopener\">phpBB</a>, al cual también empecé a hacerle <a href=\"/2007-12-19--resize-images-for-phpbb3/\">modificaciones</a>. Había noches en las que me la pasaba programando hasta amanecer sin darme cuenta. También ayudó mucho que, de otro sitio de anime, me la pasaba en cierto chat de IRC donde había otras personas con quienes platicaba y aprendía <a href=\"/2006-03-22--simplificar-codigo/\">cosas</a> <a href=\"/2008-04-02--cosas-del-mirc-scripting/\">nuevas</a>.</p>\n<p>En 2007 fue cuando me vine al DF y tuve mi <a href=\"/2007-10-12--detectar-bloqmayus-con-javascript/\">primer trabajo</a> en serio (antes había freelanceado un poco), y desde entonces he aprendido muchísimo y he hecho cosas que ni siquiera había imaginado que se podían. Han habido veces que me han dado ganas de mandarlo todo al carajo, días que han sido muy estresantes y cansados, pero al final me gusta mucho lo que hago.</p>","frontmatter":{"title":"¿Cómo empecé a programar?","date":"June 12, 2015"}}},"pageContext":{"slug":"como-empece-a-programar","previous":{"fields":{"slug":"utiles-plugins-para-gulp"},"frontmatter":{"title":"Útiles plugins para gulp"}},"next":{"fields":{"slug":"en-busca-de-la-felicidad"},"frontmatter":{"title":"En busca de la felicidad"}}}}