{"data":{"site":{"siteMetadata":{"title":"Sin Ideas","author":"Eduardo Reveles"}},"markdownRemark":{"id":"c2e89861-6c12-59bc-831c-d7cc16f5c7ba","excerpt":"English:  When I read the news about phpBB3, I start to view the MODs that are being developed, and found  this one , and when I was looking…","html":"<p><strong>English:</strong> When I read the news about phpBB3, I start to view the MODs that are being developed, and found <a href=\"http://www.phpbb.com/community/viewtopic.php?f=70&#x26;t=577794\" target=\"_blank\" rel=\"noopener\">this one</a>, and when I was looking at it I think that I can make some improvements, for example, to take only the images on the post body.</p>\n<p>And after a few minutes of coding i get this mod. Tested on Firefox and IE7, but hope it will work on others browsers. I took the idea of the javascript function from the mod that i mention before, but of course, with some changes to keep it clean and better.</p>\n<p>What basically this mod does is resize any images within the posts body that is greater than a given width, so the forum layout will not be deformed.</p>\n<p>The features are:</p>\n<ul>\n<li>Only the images from the post are resized (at least that was supposed to do &#x3C;&#x3C;)</li>\n<li>The images that was resized open in a new window (popup)</li>\n<li>Easy to change the max width and message to display when the mouse is over the resized image</li>\n</ul>\n<p>Well, here’s the mod. I hope you can forgive my bad english, but at least hope you understand what i’m trying to say xD leave any comments you have =P</p>\n<p><strong>2011-10-25 - Note: I haven’t checked if the mod is still valid, but probably it isn’t, so i’m stoping any more downloads.</strong> </p>\n<hr>\n<p><strong>Español:</strong> Cuando lei sobre la salida del phpBB3 me puse a ver algunos de los MODs que se están desarrollando, y entre ellos me encontré con <a href=\"http://www.phpbb.com/community/viewtopic.php?f=70&#x26;t=577794\" target=\"_blank\" rel=\"noopener\">este</a>, y mientras lo veía me dije que podía mejorarlo, por ejemplo, tomando solo las imágenes dentro del post.</p>\n<p>Después de unos minutos de programar resultó esto. Lo probé en Firefox y en IE7, pero espero funcione en otros navegadores. La función javascript esta basada en la que usa el mod que mencioné anteriormente, pero con algunos cambios para hacerla mas limpia y mejor.</p>\n<p>Básicamente lo que hace este mod es achicar las imágenes dentro de los posts que sean mas anchas que un tamaño dado, para que de esta forma no se deforme el diseño del foro.</p>\n<p>Características:</p>\n<ul>\n<li>Solamente las imágenes dentro de los posts son cambiadas de tamaño.</li>\n<li>Las imágenes que se achicaron son abiertas en una nueva ventana.</li>\n<li>Es fácil cambiar el ancho máximo y el mensaje que que se muestra al poner el mouse sobre la imagen.</li>\n</ul>\n<p>Y bueno, sin mas aquí esta el mod para descargar, recuerda dejar tu comentario si tienes alguna duda.</p>\n<p><strong>2011-10-25 - Nota: No he revisado si el mod sigue siendo válido, pero probablemente no lo sea, asi que estoy deteniendo su descarga.</strong></p>","frontmatter":{"title":"Resize Images for phpBB3","date":"December 19, 2007"}}},"pageContext":{"slug":"resize-images-for-phpbb3","previous":{"fields":{"slug":"detectar-bloqmayus-con-javascript"},"frontmatter":{"title":"Detectar BloqMayus con Javascript"}},"next":{"fields":{"slug":"cual-es"},"frontmatter":{"title":"¿Cuál es...?"}}}}